// Семинар 1.
// ____________________________________________________________________

// Задача 1.
// Напишите программу которая на вход принимает число
//  и выдаёт его квадрат.
// ____________________________________________________________________
// Console.WriteLine("Введите число:");
// int firstnumber = Convert.ToInt32(Console.ReadLine());
// firstnumber *= firstnumber;
// Console.WriteLine(firstnumber);
// 
// ********************************************************************
// ____________________________________________________________________
// 
// Задача 2.
// Напишите программу которая на вход принимает два числа 
// и проверяет, является ли первое число квадратом второго.
// Как это решил я.
// ____________________________________________________________________
// Console.WriteLine("Введите первое число:");
// int num1 = Convert.ToInt32(Console.ReadLine());

// Console.WriteLine("Введите второе число:");
// int num2 = Convert.ToInt32(Console.ReadLine());
// 
// int num3 = num1 /= num2;     
 // или проще if(num1*num1 == num2)
// if(num3 == num2){    
//     Console.WriteLine("YES");
// }

// else
// {
//     Console.WriteLine("NO");
// }

// ********************************************************************
// ____________________________________________________________________

// Задача 3.
// Напишите программу которая будет выдавать
//  название недели пол заданному номеру.
// ____________________________________________________________________
// Console.WriteLine("Введите номер от 1 до 7:");
// int num1 = Convert.ToInt32(Console.ReadLine());

// if(num1 == 1){
//     Console.WriteLine("Понедельник");
// }

// if(num1 == 2){
//     Console.WriteLine("Вторник");
// }

// if(num1 == 3){
//     Console.WriteLine("Среда");
// }

// if(num1 == 4){
//     Console.WriteLine("Четверг");
// }

// if(num1 == 5){
//     Console.WriteLine("Пятница");
// }

// if(num1 == 6){
//     Console.WriteLine("Суббота");
// }

// if(num1 == 7){
//     Console.WriteLine("Воскресенье");
// }
// 
// ____________________________________________________________________
// 
// Задача 3. (решение одногруппника)
// ____________________________________________________________________

// Console.WriteLine("Введите число от 1 до 7:");
// int num1 = Convert.ToInt32(Console.ReadLine());
// switch (num1)
// {
//     case 1:
//         Console.WriteLine("Понедельник");
//     break;

//     case 2:
//         Console.WriteLine("Вторник");
//     break;

//     case 3:
//         Console.WriteLine("Среда");
//     break;
    
//     case 4:
//         Console.WriteLine("Четверг");
//     break;
    
//     case 5:
//         Console.WriteLine("Пятница");
//     break;
    
//     case 6:
//         Console.WriteLine("Суббота");
//     break;
    
//     case 7:
//         Console.WriteLine("Воскресенье");
//     break;
    
//     default:
//         Console.WriteLine("Число не входит в диапазон 1-7");
//     break;
// }
// ********************************************************************